Revit 2027 API
HermiteSurface.IsValid Method
 Checks whether this HermiteSurface object is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if this is a valid Hermite Surface, false otherwise.
Remarks
 An attempt to access or compute data in an invalid Hermite Surface will cause an exception.
See Also
Reference
HermiteSurface Class
Autodesk.Revit.DB Namespace